INSERT INTO person (first_name, last_name, middle_name, birth_date)
VALUES ('Дмитрий', 'Разин', 'Сергеевич', '1964-10-04'),
('Гелуся', 'Самаркина', 'Ибрагимовна', '1974-12-01'),
('Герман', 'Рафиков', 'Нурхайдарович','1994-04-25'),
('Джон', 'Доу','','1978-03-17'),
('Всеволод', 'Давыдов', 'Семёнович','');

INSERT INTO dim_genre (genre_name) VALUES
('Роман'),
('Пьеса'),
('Детектив'),
('Фантастика'),
('Фентези'),
('Поэма')

INSERT INTO author (first_name, last_name, middle_name) VALUES
('Лев', 'Толстой', 'Николаевич'),
('Михаил', 'Лермонтов', 'Юрьевич'),
('Агата', 'Кристи', ''),
('Джон', 'Толкин', 'Рональд Руэл'),
('Станислав', 'Лем', 'Герман'),
('Александр', 'Грибоедов', 'Снргеевич')

INSERT INTO book (name, author_id) VALUES
('Война и мир', 1),
('Анна Каренина', 1),
('Мцыри', 2),
('Экюль Пуаро', 3),
('Властелин колец', 4),
('Хоббит', 4),
('Солярис', 5),
('Горе от ума', 6)

INSERT INTO book_genre_lnk (book_id, genre_id) VALUES
(1, 1),
(2, 1),
(3, 6),
(4, 3),
(5, 5),
(6, 5),
(7, 4),
(8, 2)

INSERT INTO library_card (book_id, person_id) VALUES
(1, 4),
(2, 4),
(3, 1),
(4, 4)